SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG28/Include/efr32sg28_gpio.h
/* Bit fields for GPIO IEN */
#define _GPIO_IEN_RESETVALUE                    0x00000000UL                            /**< Default value for GPIO_IEN                  */
#define _GPIO_IEN_MASK                          0x0FFFFFFFUL                            /**< Mask for GPIO_IEN                           */
#define GPIO_IEN_EXTIEN0                        (0x1UL << 0)                            /**< External Pin Enable                         */
#define _GPIO_IEN_EXTIEN0_SHIFT                 0                                       /**< Shift value for GPIO_EXTIEN0                */
#define _GPIO_IEN_EXTIEN0_MASK                  0x1UL                                   /**< Bit mask for GPIO_EXTIEN0                   */
#define _GPIO_IEN_EXTIEN0_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for GPIO_IEN                   */
#define GPIO_IEN_EXTIEN0_DEFAULT                (_GPIO_IEN_EXTIEN0_DEFAULT << 0)        /**< Shifted mode DEFAULT for GPIO_IEN           */
#define GPIO_IEN_EXTIEN1                        (0x1UL << 1)                            /**< External Pin Enable                         */
#define _GPIO_IEN_EXTIEN1_SHIFT                 1                                       /**< Shift value for GPIO_EXTIEN1                */
#define _GPIO_IEN_EXTIEN1_MASK                  0x2UL                                   /**< Bit mask for GPIO_EXTIEN1                   */
#define _GPIO_IEN_EXTIEN1_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for GPIO_IEN                   */
#define GPIO_IEN_EXTIEN1_DEFAULT                (_GPIO_IEN_EXTIEN1_DEFAULT << 1)        /**< Shifted mode DEFAULT for GPIO_IEN           */
#define GPIO_IEN_EXTIEN2                        (0x1UL << 2)                            /**< External Pin Enable                         */
#define _GPIO_IEN_EXTIEN2_SHIFT                 2                                       /**< Shift value for GPIO_EXTIEN2                */
#define _GPIO_IEN_EXTIEN2_MASK                  0x4UL                                   /**< Bit mask for GPIO_EXTIEN2                   */
#define _GPIO_IEN_EXTIEN2_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for GPIO_IEN                   */
#define GPIO_IEN_EXTIEN2_DEFAULT                (_GPIO_IEN_EXTIEN2_DEFAULT << 2)        /**< Shifted mode DEFAULT for GPIO_IEN           */
#define GPIO_IEN_EXTIEN3                        (0x1UL << 3)                            /**< External Pin Enable                         */
#define _GPIO_IEN_EXTIEN3_SHIFT                 3                                       /**< Shift value for GPIO_EXTIEN3                */
#define _GPIO_IEN_EXTIEN3_MASK                  0x8UL                                   /**< Bit mask for GPIO_EXTIEN3                   */
#define _GPIO_IEN_EXTIEN3_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for GPIO_IEN                   */
#define GPIO_IEN_EXTIEN3_DEFAULT                (_GPIO_IEN_EXTIEN3_DEFAULT << 3)        /**< Shifted mode DEFAULT for GPIO_IEN           */
#define GPIO_IEN_EXTIEN4                        (0x1UL << 4)                            /**< External Pin Enable                         */
#define _GPIO_IEN_EXTIEN4_SHIFT                 4                                       /**< Shift value for GPIO_EXTIEN4                */
#define _GPIO_IEN_EXTIEN4_MASK                  0x10UL                                  /**< Bit mask for GPIO_EXTIEN4                   */
#define _GPIO_IEN_EXTIEN4_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for GPIO_IEN                   */
#define GPIO_IEN_EXTIEN4_DEFAULT                (_GPIO_IEN_EXTIEN4_DEFAULT << 4)        /**< Shifted mode DEFAULT for GPIO_IEN           */
#define GPIO_IEN_EXTIEN5                        (0x1UL << 5)                            /**< External Pin Enable                         */
#define _GPIO_IEN_EXTIEN5_SHIFT                 5                                       /**< Shift value for GPIO_EXTIEN5                */
#define _GPIO_IEN_EXTIEN5_MASK                  0x20UL                                  /**< Bit mask for GPIO_EXTIEN5                   */
#define _GPIO_IEN_EXTIEN5_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for GPIO_IEN                   */
#define GPIO_IEN_EXTIEN5_DEFAULT                (_GPIO_IEN_EXTIEN5_DEFAULT << 5)        /**< Shifted mode DEFAULT for GPIO_IEN           */
#define GPIO_IEN_EXTIEN6                        (0x1UL << 6)                            /**< External Pin Enable                         */
#define _GPIO_IEN_EXTIEN6_SHIFT                 6                                       /**< Shift value for GPIO_EXTIEN6                */
#define _GPIO_IEN_EXTIEN6_MASK                  0x40UL                                  /**< Bit mask for GPIO_EXTIEN6                   */
#define _GPIO_IEN_EXTIEN6_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for GPIO_IEN                   */
#define GPIO_IEN_EXTIEN6_DEFAULT                (_GPIO_IEN_EXTIEN6_DEFAULT << 6)        /**< Shifted mode DEFAULT for GPIO_IEN           */
#define GPIO_IEN_EXTIEN7                        (0x1UL << 7)                            /**< External Pin Enable                         */
#define _GPIO_IEN_EXTIEN7_SHIFT                 7                                       /**< Shift value for GPIO_EXTIEN7                */
#define _GPIO_IEN_EXTIEN7_MASK                  0x80UL                                  /**< Bit mask for GPIO_EXTIEN7                   */
#define _GPIO_IEN_EXTIEN7_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for GPIO_IEN                   */
#define GPIO_IEN_EXTIEN7_DEFAULT                (_GPIO_IEN_EXTIEN7_DEFAULT << 7)        /**< Shifted mode DEFAULT for GPIO_IEN           */
#define GPIO_IEN_EXTIEN8                        (0x1UL << 8)                            /**< External Pin Enable                         */
#define _GPIO_IEN_EXTIEN8_SHIFT                 8                                       /**< Shift value for GPIO_EXTIEN8                */
#define _GPIO_IEN_EXTIEN8_MASK                  0x100UL                                 /**< Bit mask for GPIO_EXTIEN8                   */
#define _GPIO_IEN_EXTIEN8_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for GPIO_IEN                   */
#define GPIO_IEN_EXTIEN8_DEFAULT                (_GPIO_IEN_EXTIEN8_DEFAULT << 8)        /**< Shifted mode DEFAULT for GPIO_IEN           */
#define GPIO_IEN_EXTIEN9                        (0x1UL << 9)                            /**< External Pin Enable                         */
#define _GPIO_IEN_EXTIEN9_SHIFT                 9                                       /**< Shift value for GPIO_EXTIEN9                */
#define _GPIO_IEN_EXTIEN9_MASK                  0x200UL                                 /**< Bit mask for GPIO_EXTIEN9                   */
#define _GPIO_IEN_EXTIEN9_DEFAULT               0x00000000UL                            /**< Mode DEFAULT for GPIO_IEN                   */
#define GPIO_IEN_EXTIEN9_DEFAULT                (_GPIO_IEN_EXTIEN9_DEFAULT << 9)        /**< Shifted mode DEFAULT for GPIO_IEN           */
#define GPIO_IEN_EXTIEN10                       (0x1UL << 10)                           /**< External Pin Enable                         */
#define _GPIO_IEN_EXTIEN10_SHIFT                10                                      /**< Shift value for GPIO_EXTIEN10               */
#define _GPIO_IEN_EXTIEN10_MASK                 0x400UL                                 /**< Bit mask for GPIO_EXTIEN10                  */
#define _GPIO_IEN_EXTIEN10_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for GPIO_IEN                   */
#define GPIO_IEN_EXTIEN10_DEFAULT               (_GPIO_IEN_EXTIEN10_DEFAULT << 10)      /**< Shifted mode DEFAULT for GPIO_IEN           */
#define GPIO_IEN_EXTIEN11                       (0x1UL << 11)                           /**< External Pin Enable                         */
#define _GPIO_IEN_EXTIEN11_SHIFT                11                                      /**< Shift value for GPIO_EXTIEN11               */
#define _GPIO_IEN_EXTIEN11_MASK                 0x800UL                                 /**< Bit mask for GPIO_EXTIEN11                  */
#define _GPIO_IEN_EXTIEN11_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for GPIO_IEN                   */
#define GPIO_IEN_EXTIEN11_DEFAULT               (_GPIO_IEN_EXTIEN11_DEFAULT << 11)      /**< Shifted mode DEFAULT for GPIO_IEN           */
#define GPIO_IEN_EXTIEN12                       (0x1UL << 12)                           /**< External Pin Enable                         */
#define _GPIO_IEN_EXTIEN12_SHIFT                12                                      /**< Shift value for GPIO_EXTIEN12               */
#define _GPIO_IEN_EXTIEN12_MASK                 0x1000UL                                /**< Bit mask for GPIO_EXTIEN12                  */
#define _GPIO_IEN_EXTIEN12_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for GPIO_IEN                   */
#define GPIO_IEN_EXTIEN12_DEFAULT               (_GPIO_IEN_EXTIEN12_DEFAULT << 12)      /**< Shifted mode DEFAULT for GPIO_IEN           */
#define GPIO_IEN_EXTIEN13                       (0x1UL << 13)                           /**< External Pin Enable                         */
#define _GPIO_IEN_EXTIEN13_SHIFT                13                                      /**< Shift value for GPIO_EXTIEN13               */
#define _GPIO_IEN_EXTIEN13_MASK                 0x2000UL                                /**< Bit mask for GPIO_EXTIEN13                  */
#define _GPIO_IEN_EXTIEN13_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for GPIO_IEN                   */
#define GPIO_IEN_EXTIEN13_DEFAULT               (_GPIO_IEN_EXTIEN13_DEFAULT << 13)      /**< Shifted mode DEFAULT for GPIO_IEN           */
#define GPIO_IEN_EXTIEN14                       (0x1UL << 14)                           /**< External Pin Enable                         */
#define _GPIO_IEN_EXTIEN14_SHIFT                14                                      /**< Shift value for GPIO_EXTIEN14               */
#define _GPIO_IEN_EXTIEN14_MASK                 0x4000UL                                /**< Bit mask for GPIO_EXTIEN14                  */
#define _GPIO_IEN_EXTIEN14_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for GPIO_IEN                   */
#define GPIO_IEN_EXTIEN14_DEFAULT               (_GPIO_IEN_EXTIEN14_DEFAULT << 14)      /**< Shifted mode DEFAULT for GPIO_IEN           */
#define GPIO_IEN_EXTIEN15                       (0x1UL << 15)                           /**< External Pin Enable                         */
#define _GPIO_IEN_EXTIEN15_SHIFT                15                                      /**< Shift value for GPIO_EXTIEN15               */
#define _GPIO_IEN_EXTIEN15_MASK                 0x8000UL                                /**< Bit mask for GPIO_EXTIEN15                  */
#define _GPIO_IEN_EXTIEN15_DEFAULT              0x00000000UL                            /**< Mode DEFAULT for GPIO_IEN                   */
#define GPIO_IEN_EXTIEN15_DEFAULT               (_GPIO_IEN_EXTIEN15_DEFAULT << 15)      /**< Shifted mode DEFAULT for GPIO_IEN           */
#define GPIO_IEN_EM4WUIEN0                      (0x1UL << 16)                           /**< EM4 Wake Up Interrupt En                    */
#define _GPIO_IEN_EM4WUIEN0_SHIFT               16                                      /**< Shift value for GPIO_EM4WUIEN0              */
#define _GPIO_IEN_EM4WUIEN0_MASK                0x10000UL                               /**< Bit mask for GPIO_EM4WUIEN0                 */
#define _GPIO_IEN_EM4WUIEN0_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for GPIO_IEN                   */
#define GPIO_IEN_EM4WUIEN0_DEFAULT              (_GPIO_IEN_EM4WUIEN0_DEFAULT << 16)     /**< Shifted mode DEFAULT for GPIO_IEN           */
#define GPIO_IEN_EM4WUIEN1                      (0x1UL << 17)                           /**< EM4 Wake Up Interrupt En                    */
#define _GPIO_IEN_EM4WUIEN1_SHIFT               17                                      /**< Shift value for GPIO_EM4WUIEN1              */
#define _GPIO_IEN_EM4WUIEN1_MASK                0x20000UL                               /**< Bit mask for GPIO_EM4WUIEN1                 */
#define _GPIO_IEN_EM4WUIEN1_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for GPIO_IEN                   */
#define GPIO_IEN_EM4WUIEN1_DEFAULT              (_GPIO_IEN_EM4WUIEN1_DEFAULT << 17)     /**< Shifted mode DEFAULT for GPIO_IEN           */
#define GPIO_IEN_EM4WUIEN2                      (0x1UL << 18)                           /**< EM4 Wake Up Interrupt En                    */
#define _GPIO_IEN_EM4WUIEN2_SHIFT               18                                      /**< Shift value for GPIO_EM4WUIEN2              */
#define _GPIO_IEN_EM4WUIEN2_MASK                0x40000UL                               /**< Bit mask for GPIO_EM4WUIEN2                 */
#define _GPIO_IEN_EM4WUIEN2_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for GPIO_IEN                   */
#define GPIO_IEN_EM4WUIEN2_DEFAULT              (_GPIO_IEN_EM4WUIEN2_DEFAULT << 18)     /**< Shifted mode DEFAULT for GPIO_IEN           */
#define GPIO_IEN_EM4WUIEN3                      (0x1UL << 19)                           /**< EM4 Wake Up Interrupt En                    */
#define _GPIO_IEN_EM4WUIEN3_SHIFT               19                                      /**< Shift value for GPIO_EM4WUIEN3              */
#define _GPIO_IEN_EM4WUIEN3_MASK                0x80000UL                               /**< Bit mask for GPIO_EM4WUIEN3                 */
#define _GPIO_IEN_EM4WUIEN3_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for GPIO_IEN                   */
#define GPIO_IEN_EM4WUIEN3_DEFAULT              (_GPIO_IEN_EM4WUIEN3_DEFAULT << 19)     /**< Shifted mode DEFAULT for GPIO_IEN           */
#define GPIO_IEN_EM4WUIEN4                      (0x1UL << 20)                           /**< EM4 Wake Up Interrupt En                    */
#define _GPIO_IEN_EM4WUIEN4_SHIFT               20                                      /**< Shift value for GPIO_EM4WUIEN4              */
#define _GPIO_IEN_EM4WUIEN4_MASK                0x100000UL                              /**< Bit mask for GPIO_EM4WUIEN4                 */
#define _GPIO_IEN_EM4WUIEN4_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for GPIO_IEN                   */
#define GPIO_IEN_EM4WUIEN4_DEFAULT              (_GPIO_IEN_EM4WUIEN4_DEFAULT << 20)     /**< Shifted mode DEFAULT for GPIO_IEN           */
#define GPIO_IEN_EM4WUIEN5                      (0x1UL << 21)                           /**< EM4 Wake Up Interrupt En                    */
#define _GPIO_IEN_EM4WUIEN5_SHIFT               21                                      /**< Shift value for GPIO_EM4WUIEN5              */
#define _GPIO_IEN_EM4WUIEN5_MASK                0x200000UL                              /**< Bit mask for GPIO_EM4WUIEN5                 */
#define _GPIO_IEN_EM4WUIEN5_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for GPIO_IEN                   */
#define GPIO_IEN_EM4WUIEN5_DEFAULT              (_GPIO_IEN_EM4WUIEN5_DEFAULT << 21)     /**< Shifted mode DEFAULT for GPIO_IEN           */
#define GPIO_IEN_EM4WUIEN6                      (0x1UL << 22)                           /**< EM4 Wake Up Interrupt En                    */
#define _GPIO_IEN_EM4WUIEN6_SHIFT               22                                      /**< Shift value for GPIO_EM4WUIEN6              */
#define _GPIO_IEN_EM4WUIEN6_MASK                0x400000UL                              /**< Bit mask for GPIO_EM4WUIEN6                 */
#define _GPIO_IEN_EM4WUIEN6_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for GPIO_IEN                   */
#define GPIO_IEN_EM4WUIEN6_DEFAULT              (_GPIO_IEN_EM4WUIEN6_DEFAULT << 22)     /**< Shifted mode DEFAULT for GPIO_IEN           */
#define GPIO_IEN_EM4WUIEN7                      (0x1UL << 23)                           /**< EM4 Wake Up Interrupt En                    */
#define _GPIO_IEN_EM4WUIEN7_SHIFT               23                                      /**< Shift value for GPIO_EM4WUIEN7              */
#define _GPIO_IEN_EM4WUIEN7_MASK                0x800000UL                              /**< Bit mask for GPIO_EM4WUIEN7                 */
#define _GPIO_IEN_EM4WUIEN7_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for GPIO_IEN                   */
#define GPIO_IEN_EM4WUIEN7_DEFAULT              (_GPIO_IEN_EM4WUIEN7_DEFAULT << 23)     /**< Shifted mode DEFAULT for GPIO_IEN           */
#define GPIO_IEN_EM4WUIEN8                      (0x1UL << 24)                           /**< EM4 Wake Up Interrupt En                    */
#define _GPIO_IEN_EM4WUIEN8_SHIFT               24                                      /**< Shift value for GPIO_EM4WUIEN8              */
#define _GPIO_IEN_EM4WUIEN8_MASK                0x1000000UL                             /**< Bit mask for GPIO_EM4WUIEN8                 */
#define _GPIO_IEN_EM4WUIEN8_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for GPIO_IEN                   */
#define GPIO_IEN_EM4WUIEN8_DEFAULT              (_GPIO_IEN_EM4WUIEN8_DEFAULT << 24)     /**< Shifted mode DEFAULT for GPIO_IEN           */
#define GPIO_IEN_EM4WUIEN9                      (0x1UL << 25)                           /**< EM4 Wake Up Interrupt En                    */
#define _GPIO_IEN_EM4WUIEN9_SHIFT               25                                      /**< Shift value for GPIO_EM4WUIEN9              */
#define _GPIO_IEN_EM4WUIEN9_MASK                0x2000000UL                             /**< Bit mask for GPIO_EM4WUIEN9                 */
#define _GPIO_IEN_EM4WUIEN9_DEFAULT             0x00000000UL                            /**< Mode DEFAULT for GPIO_IEN                   */
#define GPIO_IEN_EM4WUIEN9_DEFAULT              (_GPIO_IEN_EM4WUIEN9_DEFAULT << 25)     /**< Shifted mode DEFAULT for GPIO_IEN           */
#define GPIO_IEN_EM4WUIEN10                     (0x1UL << 26)                           /**< EM4 Wake Up Interrupt En                    */
#define _GPIO_IEN_EM4WUIEN10_SHIFT              26                                      /**< Shift value for GPIO_EM4WUIEN10             */
#define _GPIO_IEN_EM4WUIEN10_MASK               0x4000000UL                             /**< Bit mask for GPIO_EM4WUIEN10                */
#define _GPIO_IEN_EM4WUIEN10_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for GPIO_IEN                   */
#define GPIO_IEN_EM4WUIEN10_DEFAULT             (_GPIO_IEN_EM4WUIEN10_DEFAULT << 26)    /**< Shifted mode DEFAULT for GPIO_IEN           */
#define GPIO_IEN_EM4WUIEN11                     (0x1UL << 27)                           /**< EM4 Wake Up Interrupt En                    */
#define _GPIO_IEN_EM4WUIEN11_SHIFT              27                                      /**< Shift value for GPIO_EM4WUIEN11             */
#define _GPIO_IEN_EM4WUIEN11_MASK               0x8000000UL                             /**< Bit mask for GPIO_EM4WUIEN11                */
#define _GPIO_IEN_EM4WUIEN11_DEFAULT            0x00000000UL                            /**< Mode DEFAULT for GPIO_IEN                   */
#define GPIO_IEN_EM4WUIEN11_DEFAULT             (_GPIO_IEN_EM4WUIEN11_DEFAULT << 27)    /**< Shifted mode DEFAULT for GPIO_IEN           */

/* Bit fields for GPIO EM4WUEN */
#define _GPIO_EM4WUEN_RESETVALUE                0x00000000UL                            /**< Default value for GPIO_EM4WUEN              */
#define _GPIO_EM4WUEN_MASK                      0x0FFF0000UL                            /**< Mask for GPIO_EM4WUEN                       */
#define _GPIO_EM4WUEN_EM4WUEN_SHIFT             16                                      /**< Shift value for GPIO_EM4WUEN                */
#define _GPIO_EM4WUEN_EM4WUEN_MASK              0xFFF0000UL                             /**< Bit mask for GPIO_EM4WUEN                   */
#define _GPIO_EM4WUEN_EM4WUEN_DEFAULT           0x00000000UL                            /**< Mode DEFAULT for GPIO_EM4WUEN               */
#define GPIO_EM4WUEN_EM4WUEN_DEFAULT            (_GPIO_EM4WUEN_EM4WUEN_DEFAULT << 16)   /**< Shifted mode DEFAULT for GPIO_EM4WUEN       */

