SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG28/Include/efr32sg28_gpio.h
/* Bit fields for GPIO_LESENSE CH1OUTROUTE */
#define _GPIO_LESENSE_CH1OUTROUTE_RESETVALUE    0x00000000UL                            /**< Default value for GPIO_LESENSE_CH1OUTROUTE  */
#define _GPIO_LESENSE_CH1OUTROUTE_MASK          0x000F0003UL                            /**< Mask for GPIO_LESENSE_CH1OUTROUTE           */
#define _GPIO_LESENSE_CH1OUTROUTE_PORT_SHIFT    0                                       /**< Shift value for GPIO_PORT                   */
#define _GPIO_LESENSE_CH1OUTROUTE_PORT_MASK     0x3UL                                   /**< Bit mask for GPIO_PORT                      */
#define _GPIO_LESENSE_CH1OUTROUTE_PORT_DEFAULT  0x00000000UL                            /**< Mode DEFAULT for GPIO_LESENSE_CH1OUTROUTE   */
#define GPIO_LESENSE_CH1OUTROUTE_PORT_DEFAULT   (_GPIO_LESENSE_CH1OUTROUTE_PORT_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_LESENSE_CH1OUTROUTE*/
#define _GPIO_LESENSE_CH1OUTROUTE_PIN_SHIFT     16                                      /**< Shift value for GPIO_PIN                    */
#define _GPIO_LESENSE_CH1OUTROUTE_PIN_MASK      0xF0000UL                               /**< Bit mask for GPIO_PIN                       */
#define _GPIO_LESENSE_CH1OUTROUTE_PIN_DEFAULT   0x00000000UL                            /**< Mode DEFAULT for GPIO_LESENSE_CH1OUTROUTE   */
#define GPIO_LESENSE_CH1OUTROUTE_PIN_DEFAULT    (_GPIO_LESENSE_CH1OUTROUTE_PIN_DEFAULT << 16) /**< Shifted mode DEFAULT for GPIO_LESENSE_CH1OUTROUTE*/

/* Bit fields for GPIO_LESENSE CH2OUTROUTE */
#define _GPIO_LESENSE_CH2OUTROUTE_RESETVALUE    0x00000000UL                            /**< Default value for GPIO_LESENSE_CH2OUTROUTE  */
#define _GPIO_LESENSE_CH2OUTROUTE_MASK          0x000F0003UL                            /**< Mask for GPIO_LESENSE_CH2OUTROUTE           */
#define _GPIO_LESENSE_CH2OUTROUTE_PORT_SHIFT    0                                       /**< Shift value for GPIO_PORT                   */
#define _GPIO_LESENSE_CH2OUTROUTE_PORT_MASK     0x3UL                                   /**< Bit mask for GPIO_PORT                      */
#define _GPIO_LESENSE_CH2OUTROUTE_PORT_DEFAULT  0x00000000UL                            /**< Mode DEFAULT for GPIO_LESENSE_CH2OUTROUTE   */
#define GPIO_LESENSE_CH2OUTROUTE_PORT_DEFAULT   (_GPIO_LESENSE_CH2OUTROUTE_PORT_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_LESENSE_CH2OUTROUTE*/
#define _GPIO_LESENSE_CH2OUTROUTE_PIN_SHIFT     16                                      /**< Shift value for GPIO_PIN                    */
#define _GPIO_LESENSE_CH2OUTROUTE_PIN_MASK      0xF0000UL                               /**< Bit mask for GPIO_PIN                       */
#define _GPIO_LESENSE_CH2OUTROUTE_PIN_DEFAULT   0x00000000UL                            /**< Mode DEFAULT for GPIO_LESENSE_CH2OUTROUTE   */
#define GPIO_LESENSE_CH2OUTROUTE_PIN_DEFAULT    (_GPIO_LESENSE_CH2OUTROUTE_PIN_DEFAULT << 16) /**< Shifted mode DEFAULT for GPIO_LESENSE_CH2OUTROUTE*/

/* Bit fields for GPIO_LESENSE CH3OUTROUTE */
#define _GPIO_LESENSE_CH3OUTROUTE_RESETVALUE    0x00000000UL                            /**< Default value for GPIO_LESENSE_CH3OUTROUTE  */
#define _GPIO_LESENSE_CH3OUTROUTE_MASK          0x000F0003UL                            /**< Mask for GPIO_LESENSE_CH3OUTROUTE           */
#define _GPIO_LESENSE_CH3OUTROUTE_PORT_SHIFT    0                                       /**< Shift value for GPIO_PORT                   */
#define _GPIO_LESENSE_CH3OUTROUTE_PORT_MASK     0x3UL                                   /**< Bit mask for GPIO_PORT                      */
#define _GPIO_LESENSE_CH3OUTROUTE_PORT_DEFAULT  0x00000000UL                            /**< Mode DEFAULT for GPIO_LESENSE_CH3OUTROUTE   */
#define GPIO_LESENSE_CH3OUTROUTE_PORT_DEFAULT   (_GPIO_LESENSE_CH3OUTROUTE_PORT_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_LESENSE_CH3OUTROUTE*/
#define _GPIO_LESENSE_CH3OUTROUTE_PIN_SHIFT     16                                      /**< Shift value for GPIO_PIN                    */
#define _GPIO_LESENSE_CH3OUTROUTE_PIN_MASK      0xF0000UL                               /**< Bit mask for GPIO_PIN                       */
#define _GPIO_LESENSE_CH3OUTROUTE_PIN_DEFAULT   0x00000000UL                            /**< Mode DEFAULT for GPIO_LESENSE_CH3OUTROUTE   */
#define GPIO_LESENSE_CH3OUTROUTE_PIN_DEFAULT    (_GPIO_LESENSE_CH3OUTROUTE_PIN_DEFAULT << 16) /**< Shifted mode DEFAULT for GPIO_LESENSE_CH3OUTROUTE*/

/* Bit fields for GPIO_LESENSE CH4OUTROUTE */
#define _GPIO_LESENSE_CH4OUTROUTE_RESETVALUE    0x00000000UL                            /**< Default value for GPIO_LESENSE_CH4OUTROUTE  */
#define _GPIO_LESENSE_CH4OUTROUTE_MASK          0x000F0003UL                            /**< Mask for GPIO_LESENSE_CH4OUTROUTE           */
#define _GPIO_LESENSE_CH4OUTROUTE_PORT_SHIFT    0                                       /**< Shift value for GPIO_PORT                   */
#define _GPIO_LESENSE_CH4OUTROUTE_PORT_MASK     0x3UL                                   /**< Bit mask for GPIO_PORT                      */
#define _GPIO_LESENSE_CH4OUTROUTE_PORT_DEFAULT  0x00000000UL                            /**< Mode DEFAULT for GPIO_LESENSE_CH4OUTROUTE   */
#define GPIO_LESENSE_CH4OUTROUTE_PORT_DEFAULT   (_GPIO_LESENSE_CH4OUTROUTE_PORT_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_LESENSE_CH4OUTROUTE*/
#define _GPIO_LESENSE_CH4OUTROUTE_PIN_SHIFT     16                                      /**< Shift value for GPIO_PIN                    */
#define _GPIO_LESENSE_CH4OUTROUTE_PIN_MASK      0xF0000UL                               /**< Bit mask for GPIO_PIN                       */
#define _GPIO_LESENSE_CH4OUTROUTE_PIN_DEFAULT   0x00000000UL                            /**< Mode DEFAULT for GPIO_LESENSE_CH4OUTROUTE   */
#define GPIO_LESENSE_CH4OUTROUTE_PIN_DEFAULT    (_GPIO_LESENSE_CH4OUTROUTE_PIN_DEFAULT << 16) /**< Shifted mode DEFAULT for GPIO_LESENSE_CH4OUTROUTE*/

/* Bit fields for GPIO_LESENSE CH5OUTROUTE */
#define _GPIO_LESENSE_CH5OUTROUTE_RESETVALUE    0x00000000UL                            /**< Default value for GPIO_LESENSE_CH5OUTROUTE  */
#define _GPIO_LESENSE_CH5OUTROUTE_MASK          0x000F0003UL                            /**< Mask for GPIO_LESENSE_CH5OUTROUTE           */
#define _GPIO_LESENSE_CH5OUTROUTE_PORT_SHIFT    0                                       /**< Shift value for GPIO_PORT                   */
#define _GPIO_LESENSE_CH5OUTROUTE_PORT_MASK     0x3UL                                   /**< Bit mask for GPIO_PORT                      */
#define _GPIO_LESENSE_CH5OUTROUTE_PORT_DEFAULT  0x00000000UL                            /**< Mode DEFAULT for GPIO_LESENSE_CH5OUTROUTE   */
#define GPIO_LESENSE_CH5OUTROUTE_PORT_DEFAULT   (_GPIO_LESENSE_CH5OUTROUTE_PORT_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_LESENSE_CH5OUTROUTE*/
#define _GPIO_LESENSE_CH5OUTROUTE_PIN_SHIFT     16                                      /**< Shift value for GPIO_PIN                    */
#define _GPIO_LESENSE_CH5OUTROUTE_PIN_MASK      0xF0000UL                               /**< Bit mask for GPIO_PIN                       */
#define _GPIO_LESENSE_CH5OUTROUTE_PIN_DEFAULT   0x00000000UL                            /**< Mode DEFAULT for GPIO_LESENSE_CH5OUTROUTE   */
#define GPIO_LESENSE_CH5OUTROUTE_PIN_DEFAULT    (_GPIO_LESENSE_CH5OUTROUTE_PIN_DEFAULT << 16) /**< Shifted mode DEFAULT for GPIO_LESENSE_CH5OUTROUTE*/

/* Bit fields for GPIO_LESENSE CH6OUTROUTE */
#define _GPIO_LESENSE_CH6OUTROUTE_RESETVALUE    0x00000000UL                            /**< Default value for GPIO_LESENSE_CH6OUTROUTE  */
#define _GPIO_LESENSE_CH6OUTROUTE_MASK          0x000F0003UL                            /**< Mask for GPIO_LESENSE_CH6OUTROUTE           */
#define _GPIO_LESENSE_CH6OUTROUTE_PORT_SHIFT    0                                       /**< Shift value for GPIO_PORT                   */
#define _GPIO_LESENSE_CH6OUTROUTE_PORT_MASK     0x3UL                                   /**< Bit mask for GPIO_PORT                      */
#define _GPIO_LESENSE_CH6OUTROUTE_PORT_DEFAULT  0x00000000UL                            /**< Mode DEFAULT for GPIO_LESENSE_CH6OUTROUTE   */
#define GPIO_LESENSE_CH6OUTROUTE_PORT_DEFAULT   (_GPIO_LESENSE_CH6OUTROUTE_PORT_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_LESENSE_CH6OUTROUTE*/
#define _GPIO_LESENSE_CH6OUTROUTE_PIN_SHIFT     16                                      /**< Shift value for GPIO_PIN                    */
#define _GPIO_LESENSE_CH6OUTROUTE_PIN_MASK      0xF0000UL                               /**< Bit mask for GPIO_PIN                       */
#define _GPIO_LESENSE_CH6OUTROUTE_PIN_DEFAULT   0x00000000UL                            /**< Mode DEFAULT for GPIO_LESENSE_CH6OUTROUTE   */
#define GPIO_LESENSE_CH6OUTROUTE_PIN_DEFAULT    (_GPIO_LESENSE_CH6OUTROUTE_PIN_DEFAULT << 16) /**< Shifted mode DEFAULT for GPIO_LESENSE_CH6OUTROUTE*/

