SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32SG28/Include/efr32sg28_gpio.h
/* Bit fields for GPIO_LESENSE CH7OUTROUTE */
#define _GPIO_LESENSE_CH7OUTROUTE_RESETVALUE    0x00000000UL                            /**< Default value for GPIO_LESENSE_CH7OUTROUTE  */
#define _GPIO_LESENSE_CH7OUTROUTE_MASK          0x000F0003UL                            /**< Mask for GPIO_LESENSE_CH7OUTROUTE           */
#define _GPIO_LESENSE_CH7OUTROUTE_PORT_SHIFT    0                                       /**< Shift value for GPIO_PORT                   */
#define _GPIO_LESENSE_CH7OUTROUTE_PORT_MASK     0x3UL                                   /**< Bit mask for GPIO_PORT                      */
#define _GPIO_LESENSE_CH7OUTROUTE_PORT_DEFAULT  0x00000000UL                            /**< Mode DEFAULT for GPIO_LESENSE_CH7OUTROUTE   */
#define GPIO_LESENSE_CH7OUTROUTE_PORT_DEFAULT   (_GPIO_LESENSE_CH7OUTROUTE_PORT_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_LESENSE_CH7OUTROUTE*/
#define _GPIO_LESENSE_CH7OUTROUTE_PIN_SHIFT     16                                      /**< Shift value for GPIO_PIN                    */
#define _GPIO_LESENSE_CH7OUTROUTE_PIN_MASK      0xF0000UL                               /**< Bit mask for GPIO_PIN                       */
#define _GPIO_LESENSE_CH7OUTROUTE_PIN_DEFAULT   0x00000000UL                            /**< Mode DEFAULT for GPIO_LESENSE_CH7OUTROUTE   */
#define GPIO_LESENSE_CH7OUTROUTE_PIN_DEFAULT    (_GPIO_LESENSE_CH7OUTROUTE_PIN_DEFAULT << 16) /**< Shifted mode DEFAULT for GPIO_LESENSE_CH7OUTROUTE*/

/* Bit fields for GPIO_LESENSE CH8OUTROUTE */
#define _GPIO_LESENSE_CH8OUTROUTE_RESETVALUE    0x00000000UL                            /**< Default value for GPIO_LESENSE_CH8OUTROUTE  */
#define _GPIO_LESENSE_CH8OUTROUTE_MASK          0x000F0003UL                            /**< Mask for GPIO_LESENSE_CH8OUTROUTE           */
#define _GPIO_LESENSE_CH8OUTROUTE_PORT_SHIFT    0                                       /**< Shift value for GPIO_PORT                   */
#define _GPIO_LESENSE_CH8OUTROUTE_PORT_MASK     0x3UL                                   /**< Bit mask for GPIO_PORT                      */
#define _GPIO_LESENSE_CH8OUTROUTE_PORT_DEFAULT  0x00000000UL                            /**< Mode DEFAULT for GPIO_LESENSE_CH8OUTROUTE   */
#define GPIO_LESENSE_CH8OUTROUTE_PORT_DEFAULT   (_GPIO_LESENSE_CH8OUTROUTE_PORT_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_LESENSE_CH8OUTROUTE*/
#define _GPIO_LESENSE_CH8OUTROUTE_PIN_SHIFT     16                                      /**< Shift value for GPIO_PIN                    */
#define _GPIO_LESENSE_CH8OUTROUTE_PIN_MASK      0xF0000UL                               /**< Bit mask for GPIO_PIN                       */
#define _GPIO_LESENSE_CH8OUTROUTE_PIN_DEFAULT   0x00000000UL                            /**< Mode DEFAULT for GPIO_LESENSE_CH8OUTROUTE   */
#define GPIO_LESENSE_CH8OUTROUTE_PIN_DEFAULT    (_GPIO_LESENSE_CH8OUTROUTE_PIN_DEFAULT << 16) /**< Shifted mode DEFAULT for GPIO_LESENSE_CH8OUTROUTE*/

/* Bit fields for GPIO_LESENSE CH9OUTROUTE */
#define _GPIO_LESENSE_CH9OUTROUTE_RESETVALUE    0x00000000UL                            /**< Default value for GPIO_LESENSE_CH9OUTROUTE  */
#define _GPIO_LESENSE_CH9OUTROUTE_MASK          0x000F0003UL                            /**< Mask for GPIO_LESENSE_CH9OUTROUTE           */
#define _GPIO_LESENSE_CH9OUTROUTE_PORT_SHIFT    0                                       /**< Shift value for GPIO_PORT                   */
#define _GPIO_LESENSE_CH9OUTROUTE_PORT_MASK     0x3UL                                   /**< Bit mask for GPIO_PORT                      */
#define _GPIO_LESENSE_CH9OUTROUTE_PORT_DEFAULT  0x00000000UL                            /**< Mode DEFAULT for GPIO_LESENSE_CH9OUTROUTE   */
#define GPIO_LESENSE_CH9OUTROUTE_PORT_DEFAULT   (_GPIO_LESENSE_CH9OUTROUTE_PORT_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_LESENSE_CH9OUTROUTE*/
#define _GPIO_LESENSE_CH9OUTROUTE_PIN_SHIFT     16                                      /**< Shift value for GPIO_PIN                    */
#define _GPIO_LESENSE_CH9OUTROUTE_PIN_MASK      0xF0000UL                               /**< Bit mask for GPIO_PIN                       */
#define _GPIO_LESENSE_CH9OUTROUTE_PIN_DEFAULT   0x00000000UL                            /**< Mode DEFAULT for GPIO_LESENSE_CH9OUTROUTE   */
#define GPIO_LESENSE_CH9OUTROUTE_PIN_DEFAULT    (_GPIO_LESENSE_CH9OUTROUTE_PIN_DEFAULT << 16) /**< Shifted mode DEFAULT for GPIO_LESENSE_CH9OUTROUTE*/

/* Bit fields for GPIO_LESENSE CH10OUTROUTE */
#define _GPIO_LESENSE_CH10OUTROUTE_RESETVALUE   0x00000000UL                            /**< Default value for GPIO_LESENSE_CH10OUTROUTE */
#define _GPIO_LESENSE_CH10OUTROUTE_MASK         0x000F0003UL                            /**< Mask for GPIO_LESENSE_CH10OUTROUTE          */
#define _GPIO_LESENSE_CH10OUTROUTE_PORT_SHIFT   0                                       /**< Shift value for GPIO_PORT                   */
#define _GPIO_LESENSE_CH10OUTROUTE_PORT_MASK    0x3UL                                   /**< Bit mask for GPIO_PORT                      */
#define _GPIO_LESENSE_CH10OUTROUTE_PORT_DEFAULT 0x00000000UL                            /**< Mode DEFAULT for GPIO_LESENSE_CH10OUTROUTE  */
#define GPIO_LESENSE_CH10OUTROUTE_PORT_DEFAULT  (_GPIO_LESENSE_CH10OUTROUTE_PORT_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_LESENSE_CH10OUTROUTE*/
#define _GPIO_LESENSE_CH10OUTROUTE_PIN_SHIFT    16                                      /**< Shift value for GPIO_PIN                    */
#define _GPIO_LESENSE_CH10OUTROUTE_PIN_MASK     0xF0000UL                               /**< Bit mask for GPIO_PIN                       */
#define _GPIO_LESENSE_CH10OUTROUTE_PIN_DEFAULT  0x00000000UL                            /**< Mode DEFAULT for GPIO_LESENSE_CH10OUTROUTE  */
#define GPIO_LESENSE_CH10OUTROUTE_PIN_DEFAULT   (_GPIO_LESENSE_CH10OUTROUTE_PIN_DEFAULT << 16) /**< Shifted mode DEFAULT for GPIO_LESENSE_CH10OUTROUTE*/

/* Bit fields for GPIO_LESENSE CH11OUTROUTE */
#define _GPIO_LESENSE_CH11OUTROUTE_RESETVALUE   0x00000000UL                            /**< Default value for GPIO_LESENSE_CH11OUTROUTE */
#define _GPIO_LESENSE_CH11OUTROUTE_MASK         0x000F0003UL                            /**< Mask for GPIO_LESENSE_CH11OUTROUTE          */
#define _GPIO_LESENSE_CH11OUTROUTE_PORT_SHIFT   0                                       /**< Shift value for GPIO_PORT                   */
#define _GPIO_LESENSE_CH11OUTROUTE_PORT_MASK    0x3UL                                   /**< Bit mask for GPIO_PORT                      */
#define _GPIO_LESENSE_CH11OUTROUTE_PORT_DEFAULT 0x00000000UL                            /**< Mode DEFAULT for GPIO_LESENSE_CH11OUTROUTE  */
#define GPIO_LESENSE_CH11OUTROUTE_PORT_DEFAULT  (_GPIO_LESENSE_CH11OUTROUTE_PORT_DEFAULT << 0) /**< Shifted mode DEFAULT for GPIO_LESENSE_CH11OUTROUTE*/
#define _GPIO_LESENSE_CH11OUTROUTE_PIN_SHIFT    16                                      /**< Shift value for GPIO_PIN                    */
#define _GPIO_LESENSE_CH11OUTROUTE_PIN_MASK     0xF0000UL                               /**< Bit mask for GPIO_PIN                       */
#define _GPIO_LESENSE_CH11OUTROUTE_PIN_DEFAULT  0x00000000UL                            /**< Mode DEFAULT for GPIO_LESENSE_CH11OUTROUTE  */
#define GPIO_LESENSE_CH11OUTROUTE_PIN_DEFAULT   (_GPIO_LESENSE_CH11OUTROUTE_PIN_DEFAULT << 16) /**< Shifted mode DEFAULT for GPIO_LESENSE_CH11OUTROUTE*/

